# THIS FILE IS AUTOMATICALLY GENERATED
# Project: C:\Users\Jona\Documents\GitHub\Signaalverwerking\Labo6\Opgave1\IIR_filterProject_DFB\IIR_filterProject_DFB.cydsn\IIR_filterProject_DFB.cyprj
# Date: Fri, 18 May 2018 13:45:30 GMT
#set_units -time ns
create_clock -name {CyILO} -period 1000000 -waveform {0 500000} [list [get_pins {ClockBlock/ilo}] [get_pins {ClockBlock/clk_100k}] [get_pins {ClockBlock/clk_1k}] [get_pins {ClockBlock/clk_32k}]]
create_clock -name {CyIMO} -period 333.33333333333331 -waveform {0 166.666666666667} [list [get_pins {ClockBlock/imo}]]
create_clock -name {CyPLL_OUT} -period 12.820512820512819 -waveform {0 6.41025641025641} [list [get_pins {ClockBlock/pllout}]]
create_clock -name {CyMASTER_CLK} -period 12.820512820512819 -waveform {0 6.41025641025641} [list [get_pins {ClockBlock/clk_sync}]]
create_generated_clock -name {CyBUS_CLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 2 3} [list [get_pins {ClockBlock/clk_bus_glb}]]
create_generated_clock -name {I2C_Codec_control_IntClock} -source [get_pins {ClockBlock/clk_sync}] -edges {1 5 11} [list [get_pins {ClockBlock/dclk_glb_0}]]
create_generated_clock -name {LINE_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 49 99} [list [get_pins {ClockBlock/aclk_glb_0}]]
create_clock -name {LINE_theACLK(fixed-function)} -period 628.20512820512818 -waveform {0 314.102564102564} [get_pins {ClockBlock/aclk_glb_ff_0}]
create_generated_clock -name {VOL_theACLK} -source [get_pins {ClockBlock/clk_sync}] -edges {1 49 99} [list [get_pins {ClockBlock/aclk_glb_1}]]
create_clock -name {VOL_theACLK(fixed-function)} -period 628.20512820512818 -waveform {0 314.102564102564} [get_pins {ClockBlock/aclk_glb_ff_1}]
create_generated_clock -name {Debounce} -source [get_pins {ClockBlock/clk_sync}] -edges {1 390001 780001} [list [get_pins {ClockBlock/dclk_glb_1}]]

set_false_path -from [get_pins {__ONE__/q}]

# Component constraints for C:\Users\Jona\Documents\GitHub\Signaalverwerking\Labo6\Opgave1\IIR_filterProject_DFB\IIR_filterProject_DFB.cydsn\TopDesign\TopDesign.cysch
# Project: C:\Users\Jona\Documents\GitHub\Signaalverwerking\Labo6\Opgave1\IIR_filterProject_DFB\IIR_filterProject_DFB.cydsn\IIR_filterProject_DFB.cyprj
# Date: Fri, 18 May 2018 13:45:11 GMT
